Repository: FlutterWiz/Flutter-Portfolio
Catalog: lib/presentation/l10n/app_*.arb
Languages: tr

source: ENGINEERING
tr: MÜHENDİSLİK

# emailSubject
source: Contact
tr: İletişim

# emailBody
source: Hello, I would like to get in touch with you.
tr: Merhaba, sizinle iletişim kurmak istiyorum.

# howItStartedTitle
source: How it started
tr: Nasıl başladı

# howItStartedDescription
source: I was born in 2001 in Turkey and discovered my passion for software engineering at the age of 14. My first attempt was creating a forum called 'forumtim.com' using Simple Machines Forum (SMF). Though it didn't succeed, I didn't give up. When I started university in the Mathematics department, I dedicated myself to improving in software engineering. I began my journey with Python, like many others, and later transitioned to web development, which led to an internship at Jotform. In 2020, I discovered Flutter, a rising framework at the time, and decided to specialize as a Flutter developer. Since then, I've worked with several companies, written Medium articles, recorded YouTube videos, and created open-source projects to contribute to the developer community.
tr: 2001 yılında Türkiye'de doğdum ve 14 yaşında yazılım mühendisliğine olan tutkumun farkına vardım. İlk girişimim, Simple Machines Forum (SMF) kullanarak 'forumtim.com' adında bir forum oluşturmaktı. Başarılı olmasa da pes etmedim. Üniversitede Matematik bölümüne başladığımda, yazılım mühendisliğinde kendimi geliştirmeye adadım. Birçok kişi gibi ben de Python ile başladım ve ardından web geliştirmeye geçtim. Bu süreç, Jotform'da bir staj yapmama yol açtı. 2020 yılında, o dönem yükselişte olan Flutter ile tanıştım ve Flutter geliştiricisi olarak uzmanlaşmaya karar verdim. O zamandan beri birçok şirketle çalıştım, Medium makaleleri yazdım, YouTube videoları kaydettim ve yazılım geliştirici topluluğuna katkıda bulunmak için açık kaynak projeler oluşturdum.

# howIsItGoingTitle
source: How is it going
tr: Nasıl gidiyor

# howIsItGoingDescription
source: I am a Flutter Developer with extensive experience building intuitive and efficient mobile apps using clean coding practices. Over the years, I have collaborated with various companies to deliver high-quality Flutter applications tailored to their needs. I'm eager to take on challenging projects that push the boundaries of mobile app development. In my free time, I enjoy creating open-source projects, recording video tutorials via YouTube, and sharing insights through Medium articles.
tr: Temiz kodlama uygulamalarıyla sezgisel ve verimli mobil uygulamalar geliştirme konusunda geniş deneyime sahip bir Flutter geliştiricisiyim. Yıllar boyunca, çeşitli şirketlerle işbirliği yaparak ihtiyaçlarına göre uyarlanmış yüksek kaliteli Flutter uygulamaları teslim ettim. Mobil uygulama geliştirmede sınırları zorlayan zorlu projelere katılmaya istekliyim. Boş zamanlarımda açık kaynak projeler oluşturmaktan, YouTube üzerinden video eğitimleri kaydetmekten ve Medium makaleleri aracılığıyla içgörülerimi paylaşmaktan keyif alıyorum.

source: Hi!
tr: Merhaba!

source: My name is
tr: İsmim

# swe
source: and I am a software engineer.
tr: ve ben bir yazılım mühendisiyim.

# mapMotionFlutterDescription
source: Build a smooth & animated Map app.
tr: Animasyon kullanarak hızlı ve akıcı bir Map uygulaması.

# socialDatingDescription
source: Social dating app with Riverpod, Freezed, and DDD principles.
tr: Riverpod, Freezed, ve DDD prensiplerini kullanarak yapılan bir uygulama.

# textToImageGeneratorDescription
source: Generate images from text prompts using an advanced AI model.
tr: Yazı promptları kullanarak yapay zeka modelleri ile resimler üreten bir tool.

# dddDescription
source: Updated DDD series app with Firebase integration and BLoC state.
tr: Firebase integrasyonu ve BLoC kullanarak güncellenmiş DDD serisinin uygulaması.

# openSourceTitle
source: Open Source
tr: Açık Kaynak

# openSourceDescription
source: Open source is a fundamental part of my engineering journey. It's how I learn, grow, and contribute back to the community. I feel wonderful to have influenced others with my projects. Feel free to explore some of them on my GitHub!
tr: Açık kaynak, mühendislik yolculuğumun temel bir parçasıdır. Bu, öğrenme, büyüme ve topluluğa katkıda bulunma yolumdur. Projelerimle başkalarını etkilemiş olmaktan büyük mutluluk duyuyorum. Tamamını GitHub'ımda keşfedin!

# viewMoreOnGithubText
source: View more on GitHub
tr: GitHub'da daha fazlasını görüntüleyin

# flutterSocialChatDescription
source: Hybrid, Functional, and Designed Chat App: Flutter Social Chat.
tr: Hibrit, Fonksiyonel, ve Tasarlanmış Chat Uygulaması: Flutter Social Chat

# flutterPersonalWebsiteDescription
source: This Website is an open source project too.
tr: Bu websitesinin kendisi de açık kaynaklı bir proje.

# sponsorStream
source: Sponsored by GetStream!
tr: GetStream tarafından Sponsorluk!

source: Stay in touch
tr: Benimle bağlantıda kal

# stayInTouchSubText
source: Don't miss out on my latest posts and projects! Hit me up on Twitter to stay connected, ask questions, or just chat about anything!
tr: En son gönderilerimi ve projelerimi kaçırmayın! Bağlantıda kalmak, sorular sormak veya herhangi bir konuda sohbet etmek için bana X platformundan ulaşabilirsiniz!

source: Follow me
tr: Takip et

source: See more articles
tr: Daha fazla makale görüntüle

# writingTitleDescription
source: On Medium, I share my journey as a Flutter developer, tackling topics like state management, architecture, and challenges. In addition to writing for my personal profile, I contribute to well-known publications like CodeX and Towards Dev, helping others through my experiences and insights.
tr: Medium'da, Flutter geliştiricisi olarak yolculuğumu paylaşıyorum; state management, mimari ve zorluklar gibi konuları ele alıyorum. Kişisel profilim için yazmanın yanı sıra, CodeX ve Towards Dev gibi tanınmış yayınlara da katkıda bulunarak deneyimlerim ve görüşlerimle başkalarına yardımcı oluyorum.

# mapAppTitle
source: Building a Map app
tr: Akıcı Map Uygulaması

# dateFeb
source: Feb 16, 2025
tr: 16 Şub, 2025

# riverpodTitle
source: Riverpod Usage
tr: Riverpod Kullanımı

# dateFebSeven
source: Feb 7, 2025
tr: 7 Şub, 2025

# dateJun
source: Jun 18, 2022
tr: Haz 18, 2022

# runwaymlTitle
source: RunwayML Package
tr: RunwayML Paketi

source: PAST VIDEOS
tr: GEÇMİŞTEKİ VİDEOLAR

source: Watch
tr: İzle

# youtubeDescription
source: I share my experiences and insights on Flutter development as FlutterWiz, focusing on state management, clean architecture, and open-source projects. My videos also cover practical coding challenges and tips, providing a deeper look into the development process.
tr: FlutterWiz ismi ile, Flutter geliştirme üzerine deneyimlerimi ve görüşlerimi paylaşıyorum; state management, mimari ve açık kaynaklı projeler üzerine odaklanıyorum. Videolarım ayrıca pratik kodlama zorluklarını ve ipuçlarını ele alarak geliştirme sürecine daha derin bir bakış sunuyor.

# visitYoutubeChannelText
source: Visit FlutterWiz
tr: FlutterWiz Kanalını Ziyaret Et

# dateMarch
source: March 12, 2023
tr: 12 Mart, 2023

# flutterSohbetleriDescription
source: Chatting about the journeys of Flutter devs in Turkeyâ€”starting with me, in this first episode!
tr: Türkiye'deki Flutter geliştiricilerinin yolculuklarını sohbet ederek keşfetmek—ilk bölümde benden başlıyoruz!

# socialChatTitle
source: Flutter Social Chat Tutorial
tr: Flutter Social Chat Eğitimi

# dateJan
source: Jan 23, 2023
tr: 23 Ocak, 2023

# socialChatDescription
source: Learn to build a Flutter social chat app step by step in this tutorial series!
tr: Bu eğitim serisinde adım adım bir Flutter sosyal sohbet uygulaması nasıl yapılır öğrenin!

# flutterMapAppTitle
source: Building a Flutter Map App
tr: Flutter Map Uygulaması Eğitimi

# dateFebTwelve
source: Feb 12, 2025
tr: 12 Şub, 2025

# flutterMapAppDescription
source: Permissions & App Lifecycle, Interactive Maps, Animations & Path Tracking
tr: İzinler & Uygulamanın yaşam döngüsü, Animasyonlar & yol takibi ve dahası
